#include "mqtt_client.h"
#include "mqtt.h"


/* upstream to publish */
typedef struct __UP_Dev_Status{
    uint8_t cmd_type;   //0
    uint8_t status;     //0:goodï¼Œ1:bad
}Up_Dev_Status;

typedef struct __UP_Recog_Result{
    uint8_t cmd_type;   //08
    uint8_t p_type;     //1-è¯†åˆ«æˆåŠŸï¼Œ2-é™Œç”Ÿäºº
    uint32_t p_id;      //äººå‘˜IDï¼ˆé™Œç”Ÿäººå¡«0å ä½å³å¯ï¼‰
    uint16_t year;      //å¹´
    uint8_t month;      //æœˆ
    uint8_t day;        //æ—¥
    uint8_t hour;       //æ—¶
    uint8_t min;        //åˆ†é’Ÿ
    uint8_t sec;        //ç§’
}Up_Recog_Result;

typedef struct __UP_User_Reg_Result{
    uint8_t cmd_type;   //09
    uint32_t p_id;      //äººå‘˜ID
    uint8_t result;     //ç™»è®°ç»“æœï¼š1æˆåŠŸï¼Œ 0å¤±è´¥
}Up_User_Reg_Result;

/* downstream to subscrible */
typedef struct __CTL_Dev{
    uint8_t cmd_type;   //0
    uint8_t status;     //1-é‡æ–°å¯åŠ¨è®¾å¤‡
}Ctl_Dev;

typedef struct __CTL_User_Reg{
    uint8_t cmd_type;   //08
    uint32_t p_id;      //äººå‘˜ID
    uint8_t floor;      //æ‰€åœ¨æ¥¼å±‚
    uint32_t pic_id;    //ç…§ç‰‡ID
}Ctl_User_Reg;


typedef struct __CTL_User_Del{
    uint8_t cmd_type;   //09
    uint32_t p_id;      //äººå‘˜ID
}Ctl_User_Del;

typedef struct __CTL_User_Auth{
    uint8_t cmd_type;   //0A
    uint32_t p_id;      //äººå‘˜ID
    uint8_t perm;       //1-å…è®¸é€šè¿‡ï¼Œ2-ä¸å…è®¸é€šè¿‡
}Ctl_User_Auth;

typedef struct __CTL_OTA{
	uint8_t cmd_type; 
    uint8_t sw_version;   //08
    uint8_t hw_version;   //08
    uint8_t for_all;
    char ota_devid[20];
	char ota_file_name[20];
}CTL_OTA;


typedef struct __WM_CTL_DEV_REG{
	uint8_t cmd_type; 
    uint8_t sw_version;   //08
    uint8_t hw_version;   //08
    char ota_devid[20];
}WM_CTL_DEV_REG;

//Éè±¸Á¬½Óµ½·şÎñÆ÷ <-> ·¢ËÍ°æ±¾ĞÅÏ¢
//·şÎñÆ÷·¢ËÍota ÃüÁî

bool publish_device_status(mqtt_client *mqttc, bool device_status);

bool publish_recognize_result(mqtt_client *mqttc, uint8_t p_type, uint32_t p_id,
                              uint16_t year,uint8_t month,uint8_t day,uint8_t hour, uint8_t min, uint8_t sec);

bool publish_user_register_result(mqtt_client *mqttc, uint32_t p_id, uint8_t result);

bool subscribe_device_control(const char *buffer);

bool subscribe_user_register_or_modify(const char *buffer);

bool subscribe_user_delete(const char *buffer);

bool subscribe_user_auther(const char *buffer);

void userspace_on_message_handler(MqttMsg *msg);
